{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 21.11.2024"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Задание 1\n",
    "Написать программу «справочник».Создать два списка\n",
    "целых. Один список хранит идентификационные коды,\n",
    "второй — телефонные номера. Реализовать меню для\n",
    "пользователя:\n",
    "■ Отсортировать по идентификационным кодам;\n",
    "■ Отсортировать по номерам телефона;\n",
    "■ Вывести список пользователей с кодами и телефонами;\n",
    "■ Выход."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Меню:\n",
      "1. Отсортировать по идентификационным кодам\n",
      "2. Отсортировать по номерам телефона\n",
      "3. Вывести список пользователей с кодами и телефонами\n",
      "q. Выход\n",
      "\n",
      "Список отсортирован по идентификационным кодам.\n",
      "\n",
      "Меню:\n",
      "1. Отсортировать по идентификационным кодам\n",
      "2. Отсортировать по номерам телефона\n",
      "3. Вывести список пользователей с кодами и телефонами\n",
      "q. Выход\n",
      "\n",
      "Список отсортирован по номерам телефона.\n",
      "\n",
      "Меню:\n",
      "1. Отсортировать по идентификационным кодам\n",
      "2. Отсортировать по номерам телефона\n",
      "3. Вывести список пользователей с кодами и телефонами\n",
      "q. Выход\n",
      "\n",
      "Код: 123, Телефон: +79123456789\n",
      "Код: 456, Телефон: +79234567891\n",
      "Код: 789, Телефон: +79345678912\n",
      "Код: 101, Телефон: +79456789123\n",
      "Код: 121, Телефон: +79567891234\n",
      "Код: 213, Телефон: +79678912345\n",
      "\n",
      "Меню:\n",
      "1. Отсортировать по идентификационным кодам\n",
      "2. Отсортировать по номерам телефона\n",
      "3. Вывести список пользователей с кодами и телефонами\n",
      "q. Выход\n",
      "\n"
     ]
    }
   ],
   "source": [
    "def main():\n",
    "    id_codes = [123, 456, 789, 101, 121, 213]\n",
    "    phone_numbers = [\"+79123456789\", \"+79234567891\", \"+79345678912\", \"+79456789123\", \"+79567891234\", \"+79678912345\"]\n",
    "\n",
    "    while True:\n",
    "        print_menu()\n",
    "        choice = input(\"Выберите действие: \")\n",
    "\n",
    "        if choice == '1':\n",
    "            sort_by_id(id_codes, phone_numbers)\n",
    "        elif choice == '2':\n",
    "            sort_by_phone(phone_numbers, id_codes)\n",
    "        elif choice == '3':\n",
    "            display_users(id_codes, phone_numbers)\n",
    "        elif choice == 'q':\n",
    "            break\n",
    "        else:\n",
    "            print(\"Неверный ввод. Попробуйте снова.\")\n",
    "\n",
    "def print_menu():\n",
    "    print(\"\\nМеню:\")\n",
    "    print(\"1. Отсортировать по идентификационным кодам\")\n",
    "    print(\"2. Отсортировать по номерам телефона\")\n",
    "    print(\"3. Вывести список пользователей с кодами и телефонами\")\n",
    "    print(\"q. Выход\\n\")\n",
    "\n",
    "def sort_by_id(id_codes, phone_numbers):\n",
    "    zipped = zip(id_codes, phone_numbers)\n",
    "    sorted_zipped = sorted(zipped)\n",
    "    id_codes, phone_numbers = zip(*sorted_zipped)\n",
    "    print(\"Список отсортирован по идентификационным кодам.\")\n",
    "\n",
    "def sort_by_phone(phone_numbers, id_codes):\n",
    "    zipped = zip(phone_numbers, id_codes)\n",
    "    sorted_zipped = sorted(zipped)\n",
    "    phone_numbers, id_codes = zip(*sorted_zipped)\n",
    "    print(\"Список отсортирован по номерам телефона.\")\n",
    "\n",
    "def display_users(id_codes, phone_numbers):\n",
    "    for code, number in zip(id_codes, phone_numbers):\n",
    "        print(f\"Код: {code}, Телефон: {number}\")\n",
    "\n",
    "if __name__ == \"__main__\":\n",
    "    main()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Задание 2\n",
    "Написать программу «книги». Создать два списка\n",
    "годы выпуска. Реализовать меню для пользователя:\n",
    "■ Отсортировать по названию книг;\n",
    "■ Отсортировать по годам выпуска;\n",
    "■ Вывести список книг с названиями и годами выпуска;\n",
    "■ Выход;"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Меню:\n",
      "1. Отсортировать по названию книг\n",
      "2. Отсортировать по годам выпуска\n",
      "3. Вывести список книг с названиями и годами выпуска\n",
      "q. Выход\n",
      "\n",
      "Книга: Война и мир, Год выпуска: 1869\n",
      "Книга: Преступление и наказание, Год выпуска: 1866\n",
      "Книга: Мастер и Маргарита, Год выпуска: 1967\n",
      "Книга: 1984, Год выпуска: 1949\n",
      "Книга: О дивный новый мир, Год выпуска: 1932\n",
      "\n",
      "Меню:\n",
      "1. Отсортировать по названию книг\n",
      "2. Отсортировать по годам выпуска\n",
      "3. Вывести список книг с названиями и годами выпуска\n",
      "q. Выход\n",
      "\n"
     ]
    }
   ],
   "source": [
    "def main():\n",
    "    book_titles = [\"Война и мир\", \"Преступление и наказание\", \"Мастер и Маргарита\", \"1984\", \"О дивный новый мир\"]\n",
    "    release_years = [1869, 1866, 1967, 1949, 1932]\n",
    "\n",
    "    while True:\n",
    "        print_menu()\n",
    "        choice = input(\"Выберите действие: \")\n",
    "\n",
    "        if choice == '1':\n",
    "            sort_by_title(book_titles, release_years)\n",
    "        elif choice == '2':\n",
    "            sort_by_year(release_years, book_titles)\n",
    "        elif choice == '3':\n",
    "            display_books(book_titles, release_years)\n",
    "        elif choice == 'q':\n",
    "            break\n",
    "        else:\n",
    "            print(\"Неверный ввод. Попробуйте снова.\")\n",
    "\n",
    "def print_menu():\n",
    "    print(\"\\nМеню:\")\n",
    "    print(\"1. Отсортировать по названию книг\")\n",
    "    print(\"2. Отсортировать по годам выпуска\")\n",
    "    print(\"3. Вывести список книг с названиями и годами выпуска\")\n",
    "    print(\"q. Выход\\n\")\n",
    "\n",
    "def sort_by_title(titles, years):\n",
    "    zipped = zip(titles, years)\n",
    "    sorted_zipped = sorted(zipped)\n",
    "    titles, years = zip(*sorted_zipped)\n",
    "    print(\"Список отсортирован по названиям книг.\")\n",
    "\n",
    "def sort_by_year(years, titles):\n",
    "    zipped = zip(years, titles)\n",
    "    sorted_zipped = sorted(zipped)\n",
    "    years, titles = zip(*sorted_zipped)\n",
    "    print(\"Список отсортирован по годам выпуска.\")\n",
    "\n",
    "def display_books(titles, years):\n",
    "    for title, year in zip(titles, years):\n",
    "        print(f\"Книга: {title}, Год выпуска: {year}\")\n",
    "\n",
    "if __name__ == \"__main__\":\n",
    "    main()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
